#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: d4920bfbf8844929d2636cf0779606f1.pdb
; shader hash: d4920bfbf8844929d2636cf0779606f1
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
; cbuffer CbBake
; {
;
;   struct CbBake
;   {
;
;       int FaceIndex;                                ; Offset:    0
;       float Roughness;                              ; Offset:    4
;       float Width;                                  ; Offset:    8

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !77)
!1 = !DIFile(filename: "..\5Cres\5CIntegrateSpecularLD_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !24, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 15, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 15, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 111, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 111, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 111, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 111, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 15, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 15, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !{!32, !40, !45, !48, !51, !56, !65, !69, !74}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 109, type: !33, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !35}
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 4, size: 192, align: 32, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !36, file: !1, line: 6, baseType: !4, size: 128, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !36, file: !1, line: 7, baseType: !24, size: 64, align: 32, offset: 128)
!40 = !DISubprogram(name: "CalcDirection", linkageName: "\01?CalcDirection@@YA?AV?$vector@M$02@@V?$vector@M$01@@H@Z", scope: !41, file: !41, line: 15, type: !42, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DIFile(filename: "..\5Cres/BakeUtil.hlsli", directory: "")
!42 = !DISubroutineType(types: !43)
!43 = !{!16, !24, !44}
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!45 = !DISubprogram(name: "filterColor", linkageName: "\01?filterColor@@YA?AV?$vector@M$02@@V1@@Z", scope: !1, file: !1, line: 66, type: !46, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!16, !16}
!48 = !DISubprogram(name: "GetImportanceSample", linkageName: "\01?GetImportanceSample@@YA?AV?$vector@M$03@@HHV?$vector@M$02@@M@Z", scope: !41, file: !41, line: 136, type: !49, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!4, !15, !15, !16, !8}
!51 = !DISubprogram(name: "Hammersley", linkageName: "\01?Hammersley@@YA?AV?$vector@M$01@@II@Z", scope: !41, file: !41, line: 9, type: !52, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!24, !54, !54}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 3, baseType: !55)
!55 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!56 = !DISubprogram(name: "GGX", linkageName: "\01?GGX@@YA?AUMicrofacetDistributionSample@@V?$vector@M$01@@M@Z", scope: !41, file: !41, line: 110, type: !57, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !24, !8}
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "MicrofacetDistributionSample", file: !41, line: 97, size: 128, align: 32, elements: !60)
!60 = !{!61, !62, !63, !64}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "pdf", scope: !59, file: !41, line: 99, baseType: !8, size: 32, align: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "cosTheta", scope: !59, file: !41, line: 100, baseType: !8, size: 32, align: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "sinTheta", scope: !59, file: !41, line: 101, baseType: !8, size: 32, align: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !59, file: !41, line: 102, baseType: !8, size: 32, align: 32, offset: 96)
!65 = !DISubprogram(name: "D_GGX", linkageName: "\01?D_GGX@@YAMMM@Z", scope: !66, file: !66, line: 37, type: !67, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DIFile(filename: "..\5Cres/BRDF.hlsli", directory: "")
!67 = !DISubroutineType(types: !68)
!68 = !{!8, !8, !8}
!69 = !DISubprogram(name: "TangentSpace", linkageName: "\01?TangentSpace@@YAXV?$vector@M$02@@AIAV1@1@Z", scope: !41, file: !41, line: 48, type: !70, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !16, !72, !72}
!72 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!74 = !DISubprogram(name: "computeLod", linkageName: "\01?computeLod@@YAMMHH@Z", scope: !41, file: !41, line: 164, type: !75, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!8, !8, !15, !15}
!77 = !{!78, !79, !81, !82, !83, !85, !89}
!78 = !DIGlobalVariable(name: "FaceIndex", linkageName: "\01?FaceIndex@CbBake@@3HB", scope: !0, file: !1, line: 12, type: !44, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariable(name: "Roughness", linkageName: "\01?Roughness@CbBake@@3MB", scope: !0, file: !1, line: 13, type: !80, isLocal: false, isDefinition: true)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!81 = !DIGlobalVariable(name: "Width", linkageName: "\01?Width@CbBake@@3MB", scope: !0, file: !1, line: 14, type: !80, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "MipCount", linkageName: "\01?MipCount@CbBake@@3MB", scope: !0, file: !1, line: 15, type: !80, isLocal: false, isDefinition: true)
!83 = !DIGlobalVariable(name: "SampleCount", scope: !0, file: !41, line: 3, type: !84, isLocal: true, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!85 = !DIGlobalVariable(name: "IBLCube", linkageName: "\01?IBLCube@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 18, type: !86, isLocal: false, isDefinition: true)
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 18, size: 128, align: 32, elements: !2, templateParams: !87)
!87 = !{!88}
!88 = !DITemplateTypeParameter(name: "element", type: !5)
!89 = !DIGlobalVariable(name: "IBLSmp", linkageName: "\01?IBLSmp@@3USamplerState@@A", scope: !0, file: !1, line: 19, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 19, size: 32, align: 32, elements: !2)
!91 = !{i32 2, !"Dwarf Version", i32 4}
!92 = !{i32 2, !"Debug Info Version", i32 3}
!93 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
