#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: e436ca84687d57b072b11015a8228e93.pdb
; shader hash: e436ca84687d57b072b11015a8228e93
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
;
; ViewId state:
;
; Number of inputs: 6, outputs: 4

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !31, globals: !73)
!1 = !DIFile(filename: "..\5Cres\5CIntegrateDFG_PS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !8, !24}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 103, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 103, size: 96, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !20, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 103, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 103, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !17, file: !1, line: 103, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !{!13, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !{!32, !40, !43, !47, !52, !61, !65, !70}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 96, type: !33, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !35}
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 3, size: 192, align: 32, elements: !37)
!37 = !{!38, !39}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !36, file: !1, line: 5, baseType: !4, size: 128, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !36, file: !1, line: 6, baseType: !24, size: 64, align: 32, offset: 128)
!40 = !DISubprogram(name: "LUT", linkageName: "\01?LUT@@YA?AV?$vector@M$02@@MM@Z", scope: !1, file: !1, line: 43, type: !41, isLocal: false, isDefinition: true, scopeLine: 44, flags: DIFlagPrototyped, isOptimized: false)
!41 = !DISubroutineType(types: !42)
!42 = !{!16, !8, !8}
!43 = !DISubprogram(name: "GetImportanceSample", linkageName: "\01?GetImportanceSample@@YA?AV?$vector@M$03@@HHV?$vector@M$02@@M@Z", scope: !44, file: !44, line: 136, type: !45, isLocal: false, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DIFile(filename: "..\5Cres/BakeUtil.hlsli", directory: "")
!45 = !DISubroutineType(types: !46)
!46 = !{!4, !15, !15, !16, !8}
!47 = !DISubprogram(name: "Hammersley", linkageName: "\01?Hammersley@@YA?AV?$vector@M$01@@II@Z", scope: !44, file: !44, line: 9, type: !48, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false)
!48 = !DISubroutineType(types: !49)
!49 = !{!24, !50, !50}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 3, baseType: !51)
!51 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!52 = !DISubprogram(name: "GGX", linkageName: "\01?GGX@@YA?AUMicrofacetDistributionSample@@V?$vector@M$01@@M@Z", scope: !44, file: !44, line: 110, type: !53, isLocal: false, isDefinition: true, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!55, !24, !8}
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "MicrofacetDistributionSample", file: !44, line: 97, size: 128, align: 32, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "pdf", scope: !55, file: !44, line: 99, baseType: !8, size: 32, align: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "cosTheta", scope: !55, file: !44, line: 100, baseType: !8, size: 32, align: 32, offset: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sinTheta", scope: !55, file: !44, line: 101, baseType: !8, size: 32, align: 32, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "phi", scope: !55, file: !44, line: 102, baseType: !8, size: 32, align: 32, offset: 96)
!61 = !DISubprogram(name: "D_GGX", linkageName: "\01?D_GGX@@YAMMM@Z", scope: !62, file: !62, line: 37, type: !63, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DIFile(filename: "..\5Cres/BRDF.hlsli", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{!8, !8, !8}
!65 = !DISubprogram(name: "TangentSpace", linkageName: "\01?TangentSpace@@YAXV?$vector@M$02@@AIAV1@1@Z", scope: !44, file: !44, line: 48, type: !66, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !16, !68, !68}
!68 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!70 = !DISubprogram(name: "V_GGX", linkageName: "\01?V_GGX@@YAMMMM@Z", scope: !62, file: !62, line: 49, type: !71, isLocal: false, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!8, !8, !8, !8}
!73 = !{!74, !76}
!74 = !DIGlobalVariable(name: "SampleCount", scope: !0, file: !44, line: 3, type: !75, isLocal: true, isDefinition: true)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!76 = !DIGlobalVariable(name: "sampleCount", scope: !40, file: !1, line: 62, type: !77, isLocal: true, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
