#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xyz         1     NONE   float   xyz 
;
; shader debug name: 5c89fbbd3df9e8b8110f2bc557de8a37.pdb
; shader hash: 5c89fbbd3df9e8b8110f2bc557de8a37
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Buffer Definitions:
;
; cbuffer CbSkyBox
; {
;
;   struct hostlayout.CbSkyBox
;   {
;
;       column_major float4x4 World;                  ; Offset:    0
;       column_major float4x4 View;                   ; Offset:   64
;       column_major float4x4 Proj;                   ; Offset:  128
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !35)
!1 = !DIFile(filename: "..\5Cres\5CSkyBoxVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 16, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 16, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 19, type: !18, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 6, size: 224, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 8, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 9, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 16, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 16, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 16, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 16, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 1, size: 96, align: 32, elements: !33)
!33 = !{!34}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !32, file: !1, line: 3, baseType: !24, size: 96, align: 32)
!35 = !{!36, !60, !61}
!36 = !DIGlobalVariable(name: "World", linkageName: "\01?World@CbSkyBox@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 14, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 14, baseType: !39)
!39 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 14, size: 512, align: 32, elements: !40, templateParams: !57)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !39, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!57 = !{!13, !58, !59}
!58 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!59 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!60 = !DIGlobalVariable(name: "View", linkageName: "\01?View@CbSkyBox@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 15, type: !37, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "Proj", linkageName: "\01?Proj@CbSkyBox@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 16, type: !37, isLocal: false, isDefinition: true)
!62 = !{i32 2, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!65 = !{!"..\5Cres\5CSkyBoxVS.hlsl", !"struct VSInput\0D\0A{\0D\0A\09float3 Position : POSITION;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A\09float4 Position : SV_POSITION;\0D\0A\09float3 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Acbuffer CbSkyBox : register(b0)\0D\0A{\0D\0A\09float4x4 World : packoffset(c0);\0D\0A\09float4x4 View : packoffset(c4);\0D\0A\09float4x4 Proj : packoffset(c8);\0D\0A}\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A\09VSOutput output = (VSOutput)0;\0D\0A\0D\0A\09float4 cameraWorldPos = mul(World, float4(0, 0, 0, 1));\0D\0A\0D\0A\09float4 worldPos = mul(World, float4(input.Position, 1.0f));\0D\0A\09float4 viewPos = mul(View, worldPos);\0D\0A\09float4 projPos = mul(Proj, viewPos);\0D\0A\0D\0A\09output.Position = projPos;\0D\0A\09output.TexCoord = worldPos.xyz - cameraWorldPos.xyz;\0D\0A\0D\0A\09return output;\0D\0A}"}
!66 = !{!"..\5Cres\5CSkyBoxVS.hlsl"}
!67 = !{!"-E", !"main", !"-T", !"vs_6_6", !"/Fo", !"C:\5CUsers\5Cmongr\5CDocuments\5CMillRenderer\5CSample\5Cproject\5Cx64\5CDebug\5CSkyBoxVS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!68 = !{i32 1, i32 6}
!69 = !{!"vs", i32 6, i32 6}
!70 = !{null, null, !71, null}
!71 = !{!72}
!72 = !{i32 0, %hostlayout.CbSkyBox* undef, !"CbSkyBox", i32 0, i32 0, i32 1, i32 192, null}
!73 = !{i32 0, %hostlayout.CbSkyBox undef, !74}
!74 = !{i32 192, !75, !77, !78}
!75 = !{i32 6, !"World", i32 2, !76, i32 3, i32 0, i32 7, i32 9, i32 9, i1 true}
!76 = !{i32 4, i32 4, i32 2}
!77 = !{i32 6, !"View", i32 2, !76, i32 3, i32 64, i32 7, i32 9, i32 9, i1 true}
!78 = !{i32 6, !"Proj", i32 2, !76, i32 3, i32 128, i32 7, i32 9, i32 9, i1 true}
!79 = !{i32 1, void ()* @main, !80}
!80 = !{!81}
!81 = !{i32 0, !2, !2}
!82 = !{[5 x i32] [i32 3, i32 7, i32 127, i32 127, i32 127]}
!83 = !{void ()* @main, !"main", !84, !70, !93}
!84 = !{!85, !89, null}
!85 = !{!86}
!86 = !{i32 0, !"POSITION", i8 9, i8 0, !87, i8 0, i32 1, i8 3, i32 0, i8 0, !88}
!87 = !{i32 0}
!88 = !{i32 3, i32 7}
!89 = !{!90, !92}
!90 = !{i32 0, !"SV_Position", i8 9, i8 3, !87, i8 4, i32 1, i8 4, i32 0, i8 0, !91}
!91 = !{i32 3, i32 15}
!92 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !87, i8 2, i32 1, i8 3, i32 1, i8 0, !88}
!93 = !{i32 0, i64 1}
!94 = !DILocation(line: 19, column: 23, scope: !17)
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 19, type: !32)
!96 = !DIExpression(DW_OP_bit_piece, 0, 32)
!97 = !DIExpression(DW_OP_bit_piece, 32, 32)
!98 = !DIExpression(DW_OP_bit_piece, 64, 32)
!99 = !DILocation(line: 21, column: 30, scope: !17)
!100 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 0, scope: !17, file: !1, line: 21, type: !20)
!101 = !DIExpression(DW_OP_bit_piece, 0, 128)
!102 = !DIExpression(DW_OP_bit_piece, 128, 96)
!103 = !DILocation(line: 23, column: 30, scope: !17)
!104 = !DILocation(line: 23, column: 26, scope: !17)
!105 = !DILocation(line: 23, column: 9, scope: !17)
!106 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "cameraWorldPos", scope: !17, file: !1, line: 23, type: !4)
!107 = !DILocation(line: 25, column: 24, scope: !17)
!108 = !DILocation(line: 25, column: 20, scope: !17)
!109 = !DILocation(line: 25, column: 9, scope: !17)
