#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xyz         1     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
; SV_Target                1   xyzw        1   TARGET   float   xyzw
; SV_Target                2   xy          2   TARGET   float   xy  
;
; shader debug name: a1cd2a6e17dbff1e1644c4a0e4154b6b.pdb
; shader hash: a1cd2a6e17dbff1e1644c4a0e4154b6b
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
; SV_Target                1                              
; SV_Target                2                              
;
; Buffer Definitions:
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !44)
!1 = !DIFile(filename: "..\5Cres\5CSkyBoxPS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 17, type: !5, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !31}
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSOutput", file: !1, line: 7, size: 320, align: 32, elements: !8)
!8 = !{!9, !22, !23}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !7, file: !1, line: 9, baseType: !10, size: 128, align: 32)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !12, templateParams: !18)
!12 = !{!13, !15, !16, !17}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !11, file: !1, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!18 = !{!19, !20}
!19 = !DITemplateTypeParameter(name: "element", type: !14)
!20 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 4)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !7, file: !1, line: 10, baseType: !10, size: 128, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "MetallicRoughness", scope: !7, file: !1, line: 11, baseType: !24, size: 64, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!19, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 1, size: 224, align: 32, elements: !33)
!33 = !{!34, !35}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !32, file: !1, line: 3, baseType: !10, size: 128, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !32, file: !1, line: 4, baseType: !36, size: 96, align: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !38, templateParams: !42)
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!19, !43}
!43 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 3)
!44 = !{!45, !49}
!45 = !DIGlobalVariable(name: "CubeMap", linkageName: "\01?CubeMap@@3V?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 14, type: !46, isLocal: false, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 14, size: 128, align: 32, elements: !2, templateParams: !47)
!47 = !{!48}
!48 = !DITemplateTypeParameter(name: "element", type: !11)
!49 = !DIGlobalVariable(name: "CubeSmp", linkageName: "\01?CubeSmp@@3USamplerState@@A", scope: !0, file: !1, line: 15, type: !50, isLocal: false, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 15, size: 32, align: 32, elements: !2)
!51 = !{i32 2, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!54 = !{!"..\5Cres\5CSkyBoxPS.hlsl", !"struct VSOutput\0D\0A{\0D\0A\09float4 Position : SV_POSITION;\0D\0A\09float3 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct PSOutput\0D\0A{\0D\0A\09float4 Color : SV_TARGET0;\0D\0A\09float4 Normal : SV_TARGET1;\0D\0A\09float2 MetallicRoughness : SV_TARGET2;\0D\0A};\0D\0A\0D\0ATextureCube CubeMap : register(t0);\0D\0ASamplerState CubeSmp : register(s0);\0D\0A\0D\0APSOutput main(const VSOutput input)\0D\0A{\0D\0A\09PSOutput output;\0D\0A\0D\0A\09output.Color = CubeMap.SampleLevel(CubeSmp, input.TexCoord, 0);\0D\0A\0D\0A\09// \E6\B3\95\E7\B7\9A\E3\81\AF(0, 0, 0)\E6\89\B1\E3\81\84\0D\0A\09output.Normal.xyz = 0.5f;\0D\0A\09output.Normal.a = 1;\0D\0A\0D\0A\09// \E5\8F\8D\E5\B0\84\E3\82\92\E8\B5\B7\E3\81\93\E3\81\95\E3\81\AA\E3\81\84\E3\82\88\E3\81\86\E3\81\AB\E3\83\A1\E3\82\BF\E3\83\AA\E3\83\83\E3\82\AF\E3\81\AF0\E3\80\81roughness\E3\81\AF1\0D\0A\09output.MetallicRoughness.r = 0;\0D\0A\09output.MetallicRoughness.g = 1;\0D\0A\0D\0A\09return output;\0D\0A}"}
!55 = !{!"..\5Cres\5CSkyBoxPS.hlsl"}
!56 = !{!"-E", !"main", !"-T", !"ps_6_6", !"/Fo", !"C:\5CUsers\5Cmongr\5CDocuments\5CMillRenderer\5CSample\5Cproject\5Cx64\5CDebug\5CSkyBoxPS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!57 = !{i32 1, i32 6}
!58 = !{!"ps", i32 6, i32 6}
!59 = !{!60, null, null, !63}
!60 = !{!61}
!61 = !{i32 0, %"class.TextureCube<vector<float, 4> >"* undef, !"CubeMap", i32 0, i32 0, i32 1, i32 5, i32 0, !62}
!62 = !{i32 0, i32 9}
!63 = !{!64}
!64 = !{i32 0, %struct.SamplerState* undef, !"CubeSmp", i32 0, i32 0, i32 1, i32 0, null}
!65 = !{i32 1, void ()* @main, !66}
!66 = !{!67}
!67 = !{i32 0, !2, !2}
!68 = !{[9 x i32] [i32 7, i32 10, i32 0, i32 0, i32 0, i32 0, i32 15, i32 15, i32 15]}
!69 = !{void ()* @main, !"main", !70, !59, !84}
!70 = !{!71, !76, null}
!71 = !{!72, !74}
!72 = !{i32 0, !"SV_Position", i8 9, i8 3, !73, i8 4, i32 1, i8 4, i32 0, i8 0, null}
!73 = !{i32 0}
!74 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !73, i8 2, i32 1, i8 3, i32 1, i8 0, !75}
!75 = !{i32 3, i32 7}
!76 = !{!77, !79, !81}
!77 = !{i32 0, !"SV_Target", i8 9, i8 16, !73, i8 0, i32 1, i8 4, i32 0, i8 0, !78}
!78 = !{i32 3, i32 15}
!79 = !{i32 1, !"SV_Target", i8 9, i8 16, !80, i8 0, i32 1, i8 4, i32 1, i8 0, !78}
!80 = !{i32 1}
!81 = !{i32 2, !"SV_Target", i8 9, i8 16, !82, i8 0, i32 1, i8 2, i32 2, i8 0, !83}
!82 = !{i32 2}
!83 = !{i32 3, i32 3}
!84 = !{i32 0, i64 1}
!85 = !DILocation(line: 21, column: 17, scope: !4)
!86 = !DILocation(line: 17, column: 30, scope: !4)
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !4, file: !1, line: 17, type: !31)
!88 = !DIExpression(DW_OP_bit_piece, 128, 32)
!89 = !DIExpression(DW_OP_bit_piece, 160, 32)
!90 = !DIExpression(DW_OP_bit_piece, 192, 32)
!91 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 0, scope: !4, file: !1, line: 19, type: !7)
!92 = !DIExpression(DW_OP_bit_piece, 0, 128)
