#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
; shader debug name: c00a62b62023dacd12a5d6c7384f5935.pdb
; shader hash: c00a62b62023dacd12a5d6c7384f5935
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Buffer Definitions:
;
; cbuffer CbTransform
; {
;
;   struct hostlayout.CbTransform
;   {
;
;       column_major float4x4 World;                  ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !43)
!1 = !DIFile(filename: "..\5Cres\5CSphereToCubeVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 17, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 17, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 20, type: !18, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !31}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 7, size: 192, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 9, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 10, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 17, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 17, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 1, size: 160, align: 32, elements: !32)
!32 = !{!33, !42}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !31, file: !1, line: 3, baseType: !34, size: 96, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 17, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 17, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 17, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, line: 17, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!13, !41}
!41 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !31, file: !1, line: 4, baseType: !24, size: 64, align: 32, offset: 96)
!43 = !{!44, !68, !69}
!44 = !DIGlobalVariable(name: "World", linkageName: "\01?World@CbTransform@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 15, type: !45, isLocal: false, isDefinition: true)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 15, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 15, size: 512, align: 32, elements: !48, templateParams: !65)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !47, file: !1, line: 15, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!65 = !{!13, !66, !67}
!66 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!67 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!68 = !DIGlobalVariable(name: "View", linkageName: "\01?View@CbTransform@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 16, type: !45, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "Proj", linkageName: "\01?Proj@CbTransform@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 17, type: !45, isLocal: false, isDefinition: true)
!70 = !{i32 2, !"Dwarf Version", i32 4}
!71 = !{i32 2, !"Debug Info Version", i32 3}
!72 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!73 = !{!"..\5Cres\5CSphereToCubeVS.hlsl", !"struct VSInput\0D\0A{\0D\0A\09float3 Position : POSITION;\0D\0A\09float2 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Astruct VSOutput\0D\0A{\0D\0A\09float4 Position : SV_POSITION;\0D\0A\09float2 TexCoord : TEXCOORD;\0D\0A};\0D\0A\0D\0Acbuffer CbTransform : register(b0)\0D\0A{\0D\0A\09float4x4 World : packoffset(c0);\0D\0A\09float4x4 View : packoffset(c4);\0D\0A\09float4x4 Proj : packoffset(c8);\0D\0A}\0D\0A\0D\0AVSOutput main(VSInput input)\0D\0A{\0D\0A\09VSOutput output = (VSOutput)0;\0D\0A\0D\0A\09float4 localPos = float4(input.Position, 1.0f);\0D\0A\09float4 worldPos = mul(World, localPos);\0D\0A\09float4 viewPos = mul(View, worldPos);\0D\0A\09float4 projPos = mul(Proj, viewPos);\0D\0A\0D\0A\09output.Position = projPos;\0D\0A\09output.TexCoord = input.TexCoord;\0D\0A\0D\0A\09return output;\0D\0A}"}
!74 = !{!"..\5Cres\5CSphereToCubeVS.hlsl"}
!75 = !{!"-E", !"main", !"-T", !"vs_6_6", !"/Fo", !"C:\5CUsers\5Cmongr\5CDocuments\5CMillRenderer\5CSample\5Cproject\5Cx64\5CDebug\5CSphereToCubeVS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!76 = !{i32 1, i32 6}
!77 = !{!"vs", i32 6, i32 6}
!78 = !{null, null, !79, null}
!79 = !{!80}
!80 = !{i32 0, %hostlayout.CbTransform* undef, !"CbTransform", i32 0, i32 0, i32 1, i32 192, null}
!81 = !{i32 0, %hostlayout.CbTransform undef, !82}
!82 = !{i32 192, !83, !85, !86}
!83 = !{i32 6, !"World", i32 2, !84, i32 3, i32 0, i32 7, i32 9, i32 9, i1 true}
!84 = !{i32 4, i32 4, i32 2}
!85 = !{i32 6, !"View", i32 2, !84, i32 3, i32 64, i32 7, i32 9, i32 9, i1 true}
!86 = !{i32 6, !"Proj", i32 2, !84, i32 3, i32 128, i32 7, i32 9, i32 9, i1 true}
!87 = !{i32 1, void ()* @main, !88}
!88 = !{!89}
!89 = !{i32 0, !2, !2}
!90 = !{[8 x i32] [i32 6, i32 6, i32 15, i32 15, i32 15, i32 0, i32 16, i32 32]}
!91 = !{void ()* @main, !"main", !92, !78, !103}
!92 = !{!93, !99, null}
!93 = !{!94, !97}
!94 = !{i32 0, !"POSITION", i8 9, i8 0, !95, i8 0, i32 1, i8 3, i32 0, i8 0, !96}
!95 = !{i32 0}
!96 = !{i32 3, i32 7}
!97 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !95, i8 0, i32 1, i8 2, i32 1, i8 0, !98}
!98 = !{i32 3, i32 3}
!99 = !{!100, !102}
!100 = !{i32 0, !"SV_Position", i8 9, i8 3, !95, i8 4, i32 1, i8 4, i32 0, i8 0, !101}
!101 = !{i32 3, i32 15}
!102 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !95, i8 2, i32 1, i8 2, i32 1, i8 0, !98}
!103 = !{i32 0, i64 1}
!104 = !DILocation(line: 20, column: 23, scope: !17)
!105 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 20, type: !31)
!106 = !DIExpression(DW_OP_bit_piece, 96, 32)
!107 = !DIExpression(DW_OP_bit_piece, 128, 32)
!108 = !DIExpression(DW_OP_bit_piece, 0, 32)
!109 = !DIExpression(DW_OP_bit_piece, 32, 32)
!110 = !DIExpression(DW_OP_bit_piece, 64, 32)
!111 = !DILocation(line: 22, column: 30, scope: !17)
!112 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "output", arg: 0, scope: !17, file: !1, line: 22, type: !20)
!113 = !DIExpression(DW_OP_bit_piece, 0, 128)
!114 = !DIExpression(DW_OP_bit_piece, 128, 64)
!115 = !DILocation(line: 24, column: 9, scope: !17)
!116 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "localPos", scope: !17, file: !1, line: 24, type: !4)
